## Missing Data Handling

Why are their Missing values?? Survey--Depression Survey

    1.They hesitate to put down the information
    2.Survey informations are not that valid
    3.Men--salary
    4.Women---age
    5.People may have died----NAN

Data Science Projects---Dataset should be collected from multiple sources

### Types Of Missing Values 

   ## 1. Missing Completely at Random, [MCAR].
-> A Variable is MCAR the probablity is same for all the variables.The missing data has no reletionships withe the otehr data or a variables

In [3]:
import pandas as pd

data = pd.read_csv('train.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

<h4>-> As We can see here ( SEX ) And ( Embarked ) are the example of [MCAR]</h4>

  ## 2. Missing Data Not at Random, [MNAR].
  ###### Systimatic missing values
-> A Variable is MNAR the probablity is same for all the variables.The missing data has reletionships withe the otehr data or a variables

In [5]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

<h4>-> As We can see here ( SEX ) And ( Embarked ) are the example of [MCAR]</h4>

In [8]:
### if null thean 1 if not then 0

import numpy as np
data['cabin_null'] = np.where(data['Cabin'].isnull(),1,0)

### Percentage of null values

data['cabin_null'].mean()

0.7710437710437711

In [9]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_null
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [10]:
data.groupby(['Survived'])['cabin_null'].mean()

Survived
0    0.876138
1    0.602339
Name: cabin_null, dtype: float64

 ## 3. Missing  At Random, [MAR].
     3.Men--salary
     4.Women---age

## All The Techniques To Handling The Missing values
    
   ### NUMARIC 
   #### 1. Mean/ Median/Mode replacement
   #### 2. Random Sample Imputation
   #### 3. Capturing NAN values with a new feature
   #### 4. End of Distribution imputation
   #### 5. Arbitrary imputation
   ### CATAGORICLE
   #### 1. Frequent categories imputation
   #### 2. Adding Variable To Capture NAN
   #### 3. Replacing NAN With New Catagory